app/Controllers/Cart_controllers/Cart.php

SELECT *
FROM `compras`
WHERE `user_id` = '4'
ORDER BY `compra_id` DESC
 LIMIT 1
SELECT *
FROM `juegos`
WHERE `juegos`.`game_id` = '2'
SELECT *
FROM `categorias`
WHERE `slug` = 'destacado'
 LIMIT 1
SELECT *
FROM `juegos`
JOIN `juego_categorias` ON `juegos`.`game_id` = `juego_categorias`.`game_id`
WHERE `juego_categorias`.`category_id` = '11'
 LIMIT 8
---
    public function confirmacion()
    {
        $userId = session('user_id');
        if (!$userId) {
            return redirect()->to('/login');
        }

        // Traer la última compra del usuario
        $compra = $this->compraModel
            ->where('user_id', $userId)
            ->orderBy('compra_id', 'DESC')
            ->first();

        if (!$compra) {
            return redirect()->to('/cart')->with('error', 'No se encontró ninguna compra reciente.');
        }

        // Traer los detalles de la compra (juegos)
        $detalles = $this->detalleModel->where('compra_id', $compra['compra_id'])->findAll();
        $items = [];
        foreach ($detalles as $detalle) {
            $juego = $this->juegosModel->find($detalle['game_id']);
            if ($juego) {
                $detalle['juego'] = $juego;
            }
            $items[] = $detalle;
        }

        // juegos destacados
        $categoriaDestacado = $this->categoriaModel->where('slug', 'indie')->first();
        $juegosDestacados = [];
        if ($categoriaDestacado) {
            $juegosDestacados = $this->juegosModel
                ->join('juego_categorias', 'juegos.game_id = juego_categorias.game_id')
                ->where('juego_categorias.category_id', $categoriaDestacado['category_id'])
                ->findAll(8);

SELECT *
FROM `juegos`
WHERE `juegos`.`game_id` = '91'
---
        $total = 0;
        $itemsData = [];
        foreach ($cartItems as $item) {
            $juego = $this->juegosModel->find($item['game_id']);

INSERT INTO `compras` (`user_id`, `fecha`, `total`, `email`, `telefono`, `nombre_completo`, `dni`, `direccion`, `ciudad`, `provincia`, `pais`, `codigo_postal`, `metodo_pago`, `created_at`) VALUES ('4', '2025-06-26 10:54:42', 159.98, 'frannm1703@gmail.com', '3794148344', 'Franco Montecino', '44901069', 'Barrio 71 Viviendas', 'CORRIENTES', 'Corrientes', 'AR', '3400', 'tarjeta_credito', '2025-06-26 10:54:42')
---
        }

        // 4. Guardar la compra
        $compraId = $this->compraModel->insert([
            'user_id'        => $userId,
            'fecha'          => date('Y-m-d H:i:s'),
            'total'          => $total,
            'email'          => $this->request->getPost('email'),
            'telefono'       => $this->request->getPost('telefono'),
            'nombre_completo' => $this->request->getPost('nombre_completo'),
            'dni'            => $this->request->getPost('dni'),
            'direccion'      => $this->request->getPost('direccion'),
            'ciudad'         => $this->request->getPost('ciudad'),
            'provincia'      => $this->request->getPost('provincia'),
            'pais'           => $this->request->getPost('pais'),
            'codigo_postal'  => $this->request->getPost('codigo_postal'),
            'metodo_pago'    => 'tarjeta_credito',
            'created_at'     => date('Y-m-d H:i:s'),
        ], true);