app/Controllers/Admin_controllers/Admin.php

    public function admin()
    {

        $session = session();

        if (!$session->has('user_id') || $session->get('is_admin') != 1) {
            return redirect()->to(base_url('/'))->with('mensaje', 'Acceso no autorizado');
        }

        //! JUEGOS

        $gamesPage = $this->request->getVar('games_page') ?? 1; // obtenemos la pagina actual y la cantidad de juegos por paginasi no se especifica la pagina, se usa la 1
        $gamesPerPage = 20; // 25 es la cantidad de juegos que mostramos por pagina
        $gameFilter = $this->request->getVar('game_filter') ?? 'title'; // obtenenemos los parametros de filtrado, filtramos por titulo
        $gameDirection = $this->request->getVar('game_direction') ?? 'asc';
        $gameDirection = strtoupper($gameDirection) === 'DESC' ? 'DESC' : 'ASC'; // validamos la direccion y filtramos por el orden ascendente

        // dependiendo del filtro, ordenamos por la columna correspondiente, como filtramos por el titulo, lo hacemos alfabeticamente
        $gamesOrderBy = match ($gameFilter) {
            'title' => 'title',
            'release' => 'release_date',
            'rating' => 'rating',
            'price' => 'price',
            default => 'rating'
        };

        // obtenemos todos los juegos, solo los campos necesarios, aplicamos el orden y paginacion
        $juegos = $this->juegosModel
            ->select('game_id, title, price, release_date, card_image_url, logo_url, is_active')
            ->orderBy($gamesOrderBy, $gameDirection)
            ->paginate($gamesPerPage, 'games', $gamesPage);

        // contamos el total de juegos y calculamos el total de paginas
        $gamesTotal = $this->juegosModel->countAll();
---
SELECT COUNT(*) AS `numrows`
FROM `juegos`
SELECT `game_id`, `title`, `price`, `release_date`, `card_image_url`, `logo_url`, `is_active`
FROM `juegos`
ORDER BY `title` ASC
 LIMIT 20
SELECT COUNT(*) AS `numrows` FROM `juegos`

            default => 'user_id'
        };

        $usuarios = $this->usuariosModel
            ->select('user_id, user_img, email, nickname, created_at, last_login, is_active')
            ->orderBy($userOrderBy, $userDirection)
            ->paginate($userPerPage, 'users', $userPage);

        $userTotal = $this->usuariosModel->countAll();
---
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
SELECT `user_id`, `user_img`, `email`, `nickname`, `created_at`, `last_login`, `is_active`
FROM `usuarios`
ORDER BY `user_id` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows` FROM `usuarios`

            default => 'category_id'
        };

        $categorias = $this->categoriaModel
            ->select('categorias.category_id, categorias.name_cat, categorias.slug, COUNT(juego_categorias.game_id) as juegos_count')
            ->join('juego_categorias', 'juego_categorias.category_id = categorias.category_id', 'left')
            ->groupBy('categorias.category_id')
            ->orderBy($catOrderBy, $catDirection)
            ->paginate($catPerPage, 'categories', $catPage);

        $catTotal = $this->categoriaModel->countAll();
---
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `categorias`.`category_id`, `categorias`.`name_cat`, `categorias`.`slug`, COUNT(juego_categorias.game_id) as juegos_count
FROM `categorias`
LEFT JOIN `juego_categorias` ON `juego_categorias`.`category_id` = `categorias`.`category_id`
GROUP BY `categorias`.`category_id`
) CI_count_all_results
SELECT `categorias`.`category_id`, `categorias`.`name_cat`, `categorias`.`slug`, COUNT(juego_categorias.game_id) as juegos_count
FROM `categorias`
LEFT JOIN `juego_categorias` ON `juego_categorias`.`category_id` = `categorias`.`category_id`
GROUP BY `categorias`.`category_id`
ORDER BY `category_id` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows` FROM `categorias`

    public function admin_usuarios()
    {
        $userPage = $this->request->getVar('user_page') ?? 1; // Obtener la página actual, por defecto es 1
        $userPerPage = 10; // Número de usuarios por página

        $userFilter = $this->request->getVar('user_filter') ?? 'user_id';
        $userDirection = $this->request->getVar('user_direction') ?? 'asc';

        $userDirection = strtoupper($userDirection) === 'DESC' ? 'DESC' : 'ASC';

        $userOrderBy = match ($userFilter) {
            'email' => 'email',
            'nickname' => 'nickname',
            'created_at' => 'created_at',
            'last_login' => 'last_login',
            default => 'user_id'
        };

        $usuarios = $this->usuariosModel
            ->select('user_id, user_img, email, nickname, created_at, last_login, is_active')
            ->orderBy($userOrderBy, $userDirection)
            ->paginate($userPerPage, 'users', $userPage);

        $userTotal = $this->usuariosModel->countAll();
---
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
SELECT `user_id`, `user_img`, `email`, `nickname`, `created_at`, `last_login`, `is_active`
FROM `usuarios`
ORDER BY `user_id` ASC
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows` FROM `usuarios`

    public function admin_juegos()
    {
        // Obtenemos la página actual y la cantidad de juegos por página
        $gamesPage = $this->request->getVar('games_page') ?? 1;
        $gamesPerPage = 20;

        // Obtenemos los parámetros de filtrado
        $gameFilter = $this->request->getVar('game_filter') ?? 'alphabetic';
        $gameDirection = $this->request->getVar('game_direction') ?? 'asc';

        // Validamos la dirección
        $gameDirection = strtoupper($gameDirection) === 'DESC' ? 'DESC' : 'ASC';

        // Dependiendo del filtro, ordenamos por la columna correspondiente
        $gamesOrderBy = match ($gameFilter) {
            'title' => 'title',
            'alphabetic' => 'title',
            'release' => 'release_date',
            'rating' => 'rating',
            'price' => 'price',
            default => 'rating'
        };

        // Obtenemos todos los juegos, aplicamos orden y paginación
        $juegos = $this->juegosModel
            ->select('game_id, title, price, release_date, card_image_url, logo_url, is_active')
            ->orderBy($gamesOrderBy, $gameDirection)
            ->paginate($gamesPerPage, 'games', $gamesPage);

        $categorias = $this->categoriaModel
            ->select('category_id, name_cat, slug')
            ->findAll();

        // Contamos el total de juegos y calculamos el total de páginas
        $gamesTotal = $this->juegosModel->countAll();
---
SELECT COUNT(*) AS `numrows`
FROM `juegos`
SELECT `game_id`, `title`, `price`, `release_date`, `card_image_url`, `logo_url`, `is_active`
FROM `juegos`
ORDER BY `title` ASC
 LIMIT 20
SELECT `category_id`, `name_cat`, `slug`
FROM `categorias`
SELECT COUNT(*) AS `numrows` FROM `juegos`

            'banner_image_url' => $this->request->getPost('banner_url'),
            'logo_url' => $this->request->getPost('logo_url')
        ];
        $this->juegosModel->update($id, $gameData);

        // Actualizar categorías: eliminar las actuales y agregar las nuevas
        $this->juegoCategoriaModel->where('game_id', $id)->delete();
        $categories = $this->request->getPost('categories');
        if (is_array($categories)) {
            foreach ($categories as $catId) {
                $this->juegoCategoriaModel->insert([
                    'game_id' => $id,
                    'category_id' => $catId
                ]);
---
UPDATE `juegos` SET `title` = 'Grand Theft Auto V', `price` = '30.00', `release_date` = '2013-09-17', `developer` = 'Rockstar North', `rating` = '9.6', `about` = 'El juego de mundo abierto más ambicioso de Rockstar, que sigue las vidas entrelazadas de tres criminales en Los Santos.', `synopsis` = 'Grand Theft Auto V redefine el género de mundo abierto con su narrativa de tres protagonistas: Michael, Franklin y Trevor, cada uno con sus propias motivaciones y habilidades. La ciudad de Los Santos es un personaje en sí mismo, lleno de detalles, actividades secundarias y una sátira mordaz de la cultura estadounidense moderna.\r\n\r\nEl juego ofrece una libertad sin precedentes, permitiendo a los jugadores explorar tanto la ciudad como el campo circundante, realizar misiones elaboradas o simplemente disfrutar del caos. Con su modo en línea en constante evolución, GTA V se ha mantenido relevante años después de su lanzamiento, estableciendo nuevos récords en la industria.', `youtube_trailer_id` = 'QkkoHAzjnUs?si=ndF_vSVG_a6_cvbr', `cover_image_url` = 'https://cdn2.steamgriddb.com/grid/af0a25e27510f77d97634a6bbe653b13.jpg', `card_image_url` = 'https://cdn2.steamgriddb.com/grid/d2c9ed37f28de332e12c76ce316a8a18.png', `banner_image_url` = 'https://cdn2.steamgriddb.com/hero/48a0fbc23cf60d3a99d3e4e233243fa0.png', `logo_url` = 'https://cdn2.steamgriddb.com/logo_thumb/e5b294b70c9647dcf804d7baa1903918.png', `updated_at` = '2025-06-18 14:52:11'
WHERE `juegos`.`game_id` IN ('8')
DELETE FROM `juego_categorias`
WHERE `game_id` = '8'
INSERT INTO `juego_categorias` (`game_id`, `category_id`) VALUES ('8', '1')