app/Controllers/Admin_controllers/Admin.php

SELECT `game_id`, `title`, `price`, `special_price`, `special_price_active`, `release_date`, `card_image_url`, `logo_url`, `is_active`
FROM `juegos`
ORDER BY `title` ASC
 LIMIT 20
---
    public function admin()
    {

        $session = session();

        if (!$session->has('user_id') || $session->get('is_admin') != 1) {
            return redirect()->to(base_url('/'))->with('error-msg', 'Acceso no autorizado');
        }

        //! JUEGOS

        $gamesPage = $this->request->getVar('games_page') ?? 1; // obtenemos la pagina actual y la cantidad de juegos por paginasi no se especifica la pagina, se usa la 1
        $gamesPerPage = 20; // 25 es la cantidad de juegos que mostramos por pagina
        $gameFilter = $this->request->getVar('game_filter') ?? 'title'; // obtenenemos los parametros de filtrado, filtramos por titulo
        $gameDirection = $this->request->getVar('game_direction') ?? 'asc';
        $gameDirection = strtoupper($gameDirection) === 'DESC' ? 'DESC' : 'ASC'; // validamos la direccion y filtramos por el orden ascendente

        // dependiendo del filtro, ordenamos por la columna correspondiente, como filtramos por el titulo, lo hacemos alfabeticamente
        $gamesOrderBy = match ($gameFilter) {
            'title' => 'title',
            'release' => 'release_date',
            'rating' => 'rating',
            'price' => 'price',
            default => 'rating'
        };

        // obtenemos todos los juegos, solo los campos necesarios, aplicamos el orden y paginacion
        $juegos = $this->juegosModel
            ->select('game_id, title, price, special_price, special_price_active, release_date, card_image_url, logo_url, is_active')
            ->orderBy($gamesOrderBy, $gameDirection)
            ->paginate($gamesPerPage, 'games', $gamesPage);

SELECT *
FROM `compras`
ORDER BY `compra_id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `compras`
SELECT COUNT(*) AS `numrows` FROM `compras`
---
        $ventasPage = $this->request->getVar('ventas_page') ?? 1;
        $ventasPerPage = 10;

        $compras = $this->comprasModel
            ->orderBy('compra_id', 'DESC')
            ->paginate($ventasPerPage, 'ventas', $ventasPage);

        $ventasTotal = $this->comprasModel->countAll();

SELECT *
FROM `usuarios`
WHERE `usuarios`.`user_id` = '4'
SELECT *
FROM `juegos`
WHERE `juegos`.`game_id` = '5'
---

        $comprasData = [];
        foreach ($compras as $compra) {
            $usuario = $this->usuariosModel->find($compra['user_id']);
            $detalles = $this->detalleModel->where('compra_id', $compra['compra_id'])->findAll();
            $productos = [];
            foreach ($detalles as $detalle) {
                $juego = $this->juegosModel->find($detalle['game_id']);

SELECT *
FROM `juegos`
WHERE `juegos`.`game_id` = '54'
---
                $detalles = $this->detalleModel->where('compra_id', $compra['compra_id'])->findAll();
                $productos = [];
                foreach ($detalles as $detalle) {
                    $juego = $this->juegosModel->find($detalle['game_id']);