app/Controllers/Games_controllers/Juegos.php

    public function categoria($slug = 'todos')
    {
        $page = $this->request->getVar('page') ?? 1;
        $perPage = 10;

        $filter = $this->request->getVar('filter') ?? 'rating';
        $direction = $this->request->getVar('direction') ?? 'desc';
        $direction = strtoupper($direction) === 'ASC' ? 'ASC' : 'DESC';

        $orderBy = match ($filter) {
            'alphabetic' => 'title',
            'release' => 'release_date',
            'rating' => 'rating',
            'price' => 'price',
            default => 'rating'
        };

        $builder = $this->juegosModel
            ->select('juegos.game_id, juegos.is_active, juegos.title, juegos.price, juegos.card_image_url, juegos.youtube_trailer_id, juegos.about, juegos.rating, juegos.release_date, juegos.developer');

        if ($slug !== 'todos') {
            $categoria = $this->categoriaModel->where('slug', $slug)->first();
            if (!$categoria) {
                return redirect()->to('/')->with('error-msg', 'La categoría no existe');
            }
            $builder->join('juego_categorias', 'juego_categorias.game_id = juegos.game_id')
                ->where('juego_categorias.category_id', $categoria['category_id']);
        }

        $juegos = $builder->orderBy($orderBy, $direction)
            ->paginate($perPage, 'default', $page);
---
SELECT *
FROM `categorias`
WHERE `slug` = 'accion'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `juegos`
JOIN `juego_categorias` ON `juego_categorias`.`game_id` = `juegos`.`game_id`
WHERE `juego_categorias`.`category_id` = '1'
SELECT `juegos`.`game_id`, `juegos`.`title`, `juegos`.`price`, `juegos`.`card_image_url`, `juegos`.`youtube_trailer_id`, `juegos`.`about`, `juegos`.`rating`, `juegos`.`release_date`, `juegos`.`developer`
FROM `juegos`
JOIN `juego_categorias` ON `juego_categorias`.`game_id` = `juegos`.`game_id`
WHERE `juego_categorias`.`category_id` = '1'
ORDER BY `rating` DESC
 LIMIT 10

        $gameIds = array_column($juegos, 'game_id');
        $categoriasPorJuego = [];
        if (!empty($gameIds)) {
            $cats = $this->juegoCategoriaModel
                ->select('juego_categorias.game_id, categorias.name_cat, categorias.slug')
                ->join('categorias', 'categorias.category_id = juego_categorias.category_id')
                ->whereIn('juego_categorias.game_id', $gameIds)
                ->findAll();
---
SELECT `juego_categorias`.`game_id`, `categorias`.`name_cat`, `categorias`.`slug`
FROM `juego_categorias`
JOIN `categorias` ON `categorias`.`category_id` = `juego_categorias`.`category_id`
WHERE `juego_categorias`.`game_id` IN ('87','88','2','8','11','77','84','85','10','15')


        $deseados_ids = [];
        if (session()->has('user_id')) {
            $wishlistItems = $this->wishlistItemModel
                ->where('user_id', session('user_id'))
                ->findAll();
---
SELECT *
FROM `wishlist_items`
WHERE `user_id` = '4'