app/Controllers/User_controllers/UserProfile.php

    public function add_to_wishlist()
    {
        if (!$this->request->isAJAX()) {
            return $this->response->setStatusCode(400)->setJSON(['error' => 'Petición inválida']);
        }

        $userId = session('user_id');
        if (!$userId) {
            return $this->response->setStatusCode(401)->setJSON(['error' => 'Debes inicar sesión para acceder a esta función.']);
        }

        $gameId = $this->request->getPost('game_id');
        if (!$gameId) {
            $json = $this->request->getJSON();
            $gameId = $json->game_id ?? null;
        }
        if (!$gameId) {
            return $this->response->setStatusCode(422)->setJSON(['error' => 'ID de juego no proporcionado']);
        }

        // Verifica si el usuario ya tiene una wishlist, si no, la crea
        $wishlist = $this->wishlistModel->where('user_id', $userId)->first();
        if (!$wishlist) {
            $this->wishlistModel->insert([
                'user_id' => $userId,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ]);
        } else {
            // Actualiza la fecha de actualización
            $this->wishlistModel->update($wishlist['user_id'], [
                'updated_at' => date('Y-m-d H:i:s')
            ]);
        }

        // Verifica si el juego ya está en la wishlist
        $exists = $this->wishlistItemModel
            ->where('user_id', $userId)
            ->where('game_id', $gameId)
            ->first();

        // Agrega el juego a la wishlist
        $this->wishlistItemModel->insert([
            'user_id' => $userId,
            'game_id' => $gameId,
            'added_at' => date('Y-m-d H:i:s')
        ]);
---
SELECT *
FROM `wishlists`
WHERE `user_id` = '4'
 LIMIT 1
UPDATE `wishlists` SET `updated_at` = '2025-06-19 21:52:42'
WHERE `wishlists`.`user_id` IN ('4')
SELECT *
FROM `wishlist_items`
WHERE `user_id` = '4'
AND `game_id` = '95'
 LIMIT 1
INSERT INTO `wishlist_items` (`user_id`, `game_id`, `added_at`) VALUES ('4', '95', '2025-06-19 21:52:42')