app/Controllers/User_controllers/Usuario.php

    public function procesar_login()
    {
        $validation = \Config\Services::validation();
        $request = \Config\Services::request();
        $session = session();

        $validation->setRules([
            'usuario' => 'required',
            'contraseña' => 'required',
        ], [
            'usuario' => ['required' => 'Ingrese el nombre de usuario'],
            'contraseña' => ['required' => 'Ingrese la contraseña']
        ]);

        if (!$validation->withRequest($request)->run()) {
            return redirect()->to(base_url('login'))
                ->withInput()
                ->with('error-msg', $validation->getErrors());
        }

        $nickname = $this->request->getPost('usuario');
        $contraseña = $this->request->getPost('contraseña');

        $usuario = $this->usuarioModel->where('nickname', $nickname)->first();
---
SELECT *
FROM `usuarios`
WHERE `nickname` = 'frann17'
 LIMIT 1

        $session->set($data);

        // Actualizar fecha de último login
        $this->usuarioModel->update($usuario['user_id'], [
            'last_login' => date('Y-m-d H:i:s')
        ]);
---
UPDATE `usuarios` SET `last_login` = '2025-06-21 03:59:57', `updated_at` = '2025-06-21 03:59:57'
WHERE `usuarios`.`user_id` IN ('4')