app/Controllers/Home.php

    public function index(): string
    {
        $juegosModel = new \App\Models\JuegosModel();
        $categoriaModel = new \App\Models\CategoriaModel();

        // Juegos en oferta
        $categoriaOfertas = $categoriaModel->where('slug', 'ofertas')->first();
---
SELECT *
FROM `categorias`
WHERE `slug` = 'ofertas'
 LIMIT 1