app/Controllers/Home.php

SELECT *
FROM `wishlist_items`
WHERE `user_id` = '4'
SELECT *
FROM `juegos`
WHERE `release_date` > '2025-06-23'
ORDER BY `release_date` ASC
 LIMIT 12
SELECT *
FROM `juegos`
WHERE `special_price_active` = 1
ORDER BY `updated_at`
 LIMIT 12
SELECT *
FROM `categorias`
WHERE `slug` = 'indie'
 LIMIT 1
SELECT *
FROM `juegos`
JOIN `juego_categorias` ON `juegos`.`game_id` = `juego_categorias`.`game_id`
WHERE `juego_categorias`.`category_id` = '4'
 LIMIT 9
SELECT *
FROM `categorias`
WHERE `slug` = 'destacado'
 LIMIT 1
SELECT *
FROM `juegos`
JOIN `juego_categorias` ON `juegos`.`game_id` = `juego_categorias`.`game_id`
WHERE `juego_categorias`.`category_id` = '11'
 LIMIT 8
---
    public function index(): string
    {
        $juegosModel = new \App\Models\JuegosModel();
        $categoriaModel = new \App\Models\CategoriaModel();
        $itemDeseadosModel = new \App\Models\WishlistItemModel();
        $cartModel = new \App\Models\CartModel();
        $cartItemModel = new \App\Models\CartItemModel();


        $deseados_ids = [];
        if (session()->has('user_id')) {
            $wishlistItems = $itemDeseadosModel
                ->where('user_id', session('user_id'))
                ->findAll();
            $deseados_ids = array_column($wishlistItems, 'game_id');
        }

        // proximos lanzamientos
        $proxLanzamientos = $juegosModel
            ->where('release_date >', date('Y-m-d'))
            ->orderBy('release_date', 'ASC')
            ->findAll(12);

        // juegos en oferta
        $juegosEnOferta = $juegosModel
            ->where('special_price_active', 1)
            ->orderBy('updated_at')
            ->findAll(12);

        // juegos populares
        $categoriaPopular = $categoriaModel->where('slug', 'indie')->first();
        $juegosPopulares = [];
        if ($categoriaPopular) {
            $juegosPopulares = $juegosModel
                ->join('juego_categorias', 'juegos.game_id = juego_categorias.game_id')
                ->where('juego_categorias.category_id', $categoriaPopular['category_id'])
                ->findAll(9);
        }

        // juegos destacados
        $categoriaDestacado = $categoriaModel->where('slug', 'destacado')->first();
        $juegosDestacados = [];
        if ($categoriaDestacado) {
            $juegosDestacados = $juegosModel
                ->join('juego_categorias', 'juegos.game_id = juego_categorias.game_id')
                ->where('juego_categorias.category_id', $categoriaDestacado['category_id'])
                ->findAll(8);