app/Controllers/Juegos.php

    public function detalle($id)
    {
        // obtenemos el juego por su id
        $juego = $this->juegosModel->find($id);

        if (!$juego) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // obtenemos las imagenes de galeria del juego
        $imagenes = $this->galeriaModel
            ->select('image_url, image_order')
            ->where('game_id', $id)
            ->orderBy('image_order', 'ASC')
            ->findAll();

        // obtenemos sus categorias
        $categorias = $this->juegoCategoriaModel
            ->select('categorias.name_cat, categorias.slug')
            ->join('categorias', 'categorias.category_id = juego_categorias.category_id')
            ->where('juego_categorias.game_id', $id)
            ->findAll();
---
SELECT `juego_categorias`.`game_id`, `categorias`.`name_cat`, `categorias`.`slug`
FROM `juego_categorias`
JOIN `categorias` ON `categorias`.`category_id` = `juego_categorias`.`category_id`
WHERE `juego_categorias`.`game_id` IN ('82')