app/Controllers/Juegos.php

SELECT COUNT(*) AS `numrows`
FROM `juegos`
SELECT `game_id`, `title`, `price`, `release_date`, `card_image_url`, `is_active`, `rating`, `about`, `youtube_trailer_id`
FROM `juegos`
ORDER BY `title` ASC
 LIMIT 15
SELECT COUNT(*) AS `numrows` FROM `juegos`
---
    public function all_games()
    {
        //! JUEGOS

        $gamesPage = $this->request->getVar('games_page') ?? 1;
        $gamesPerPage = 15;
        $gameFilter = $this->request->getVar('game_filter') ?? 'title';
        $gameDirection = $this->request->getVar('game_direction') ?? 'asc';
        $gameDirection = strtoupper($gameDirection) === 'DESC' ? 'DESC' : 'ASC';

        $gamesOrderBy = match ($gameFilter) {
            'title' => 'title',
            'release' => 'release_date',
            'rating' => 'rating',
            'price' => 'price',
            default => 'rating'
        };

        // Obtenemos todos los juegos paginados
        $juegos = $this->juegosModel
            ->select('game_id, title, price, release_date, card_image_url, is_active, rating, about, youtube_trailer_id')
            ->orderBy($gamesOrderBy, $gameDirection)
            ->paginate($gamesPerPage, 'games', $gamesPage);

        $gamesTotal = $this->juegosModel->countAll();

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `categorias`.`category_id`, `categorias`.`name_cat`, `categorias`.`slug`, COUNT(juego_categorias.game_id) as juegos_count
FROM `categorias`
LEFT JOIN `juego_categorias` ON `juego_categorias`.`category_id` = `categorias`.`category_id`
GROUP BY `categorias`.`category_id`
) CI_count_all_results
SELECT `categorias`.`category_id`, `categorias`.`name_cat`, `categorias`.`slug`, COUNT(juego_categorias.game_id) as juegos_count
FROM `categorias`
LEFT JOIN `juego_categorias` ON `juego_categorias`.`category_id` = `categorias`.`category_id`
GROUP BY `categorias`.`category_id`
ORDER BY `category_id` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows` FROM `categorias`
---
            default => 'category_id'
        };

        $categorias = $this->categoriaModel
            ->select('categorias.category_id, categorias.name_cat, categorias.slug, COUNT(juego_categorias.game_id) as juegos_count')
            ->join('juego_categorias', 'juego_categorias.category_id = categorias.category_id', 'left')
            ->groupBy('categorias.category_id')
            ->orderBy($catOrderBy, $catDirection)
            ->paginate($catPerPage, 'categories', $catPage);

        $catTotal = $this->categoriaModel->countAll();

SELECT `juego_categorias`.`game_id`, `categorias`.`name_cat`, `categorias`.`slug`
FROM `juego_categorias`
JOIN `categorias` ON `categorias`.`category_id` = `juego_categorias`.`category_id`
WHERE `juego_categorias`.`game_id` IN ('54','55','62','44','20','21','73','19','82','77','84','52','41','68','78')
---
        $gameIds = array_column($juegos, 'game_id');
        $categoriasPorJuego = [];
        if (!empty($gameIds)) {
            $cats = $this->juegoCategoriaModel
                ->select('juego_categorias.game_id, categorias.name_cat, categorias.slug')
                ->join('categorias', 'categorias.category_id = juego_categorias.category_id')
                ->whereIn('juego_categorias.game_id', $gameIds)
                ->findAll();

SELECT *
FROM `wishlist_items`
WHERE `user_id` = '4'
---

        $deseados_ids = [];
        if (session()->has('user_id')) {
            $wishlistItems = $this->wishlistItemModel
                ->where('user_id', session('user_id'))
                ->findAll();

SELECT *
FROM `categorias`
WHERE `slug` = 'terror'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `juegos`
JOIN `juego_categorias` ON `juego_categorias`.`game_id` = `juegos`.`game_id`
WHERE `juego_categorias`.`category_id` = '3'
SELECT `juegos`.`game_id`, `juegos`.`title`, `juegos`.`price`, `juegos`.`card_image_url`, `juegos`.`youtube_trailer_id`, `juegos`.`about`, `juegos`.`rating`, `juegos`.`release_date`, `juegos`.`developer`
FROM `juegos`
JOIN `juego_categorias` ON `juego_categorias`.`game_id` = `juegos`.`game_id`
WHERE `juego_categorias`.`category_id` = '3'
ORDER BY `rating` DESC
 LIMIT 10
---
    public function categoria($slug = 'todos')
    {
        $page = $this->request->getVar('page') ?? 1;
        $perPage = 10;

        $filter = $this->request->getVar('filter') ?? 'rating';
        $direction = $this->request->getVar('direction') ?? 'desc';
        $direction = strtoupper($direction) === 'ASC' ? 'ASC' : 'DESC';

        $orderBy = match ($filter) {
            'alphabetic' => 'title',
            'release' => 'release_date',
            'rating' => 'rating',
            'price' => 'price',
            default => 'rating'
        };

        $builder = $this->juegosModel
            ->select('juegos.game_id, juegos.title, juegos.price, juegos.card_image_url, juegos.youtube_trailer_id, juegos.about, juegos.rating, juegos.release_date, juegos.developer');

        if ($slug !== 'todos') {
            $categoria = $this->categoriaModel->where('slug', $slug)->first();
            if (!$categoria) {
                return redirect()->to('/')->with('error-msg', 'La categoría no existe');
            }
            $builder->join('juego_categorias', 'juego_categorias.game_id = juegos.game_id')
                ->where('juego_categorias.category_id', $categoria['category_id']);
        }

        $juegos = $builder->orderBy($orderBy, $direction)
            ->paginate($perPage, 'default', $page);

SELECT `juego_categorias`.`game_id`, `categorias`.`name_cat`, `categorias`.`slug`
FROM `juego_categorias`
JOIN `categorias` ON `categorias`.`category_id` = `juego_categorias`.`category_id`
WHERE `juego_categorias`.`game_id` IN ('87','58','43','44','56','59','45','60','79','54')
---
        $gameIds = array_column($juegos, 'game_id');
        $categoriasPorJuego = [];
        if (!empty($gameIds)) {
            $cats = $this->juegoCategoriaModel
                ->select('juego_categorias.game_id, categorias.name_cat, categorias.slug')
                ->join('categorias', 'categorias.category_id = juego_categorias.category_id')
                ->whereIn('juego_categorias.game_id', $gameIds)
                ->findAll();

SELECT *
FROM `wishlist_items`
WHERE `user_id` = '14'
---

        $deseados_ids = [];
        if (session()->has('user_id')) {
            $wishlistItems = $this->wishlistItemModel
                ->where('user_id', session('user_id'))
                ->findAll();

SELECT *
FROM `juegos`
WHERE `special_price_active` = 1
 LIMIT 10
---
    public function ofertas()
    {
        // juegos en oferta
        $juegosEnOferta = $this->juegosModel->where('special_price_active', 1)->findAll(10);